# RA2011003010528
# A RAMANAGIRI
# PANDAS ASSIGNMENT

In [15]:

import pandas as pd
import numpy as np

#CREATING A DATAFRAME

ONLINE_CLASSES= {
    'Courses':["HTML","Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[60000,22000,25000,23000,24000,26000],
    'Duration':['20days','30days','50days','30days', None,np.nan],
    'Discount':[6000,1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(ONLINE_CLASSES)
print(df)

   Courses    Fee Duration  Discount
0     HTML  60000   20days      6000
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300
3   Hadoop  23000   30days      1000
4   Python  24000     None      1200
5   Pandas  26000      NaN      2500

In [16]:

df2=df[df["Courses"] == 'Spark'] 
print(df2)

  Courses    Fee Duration  Discount
1   Spark  22000   30days      1000

In [17]:

value="Spark"
df2=df[df["Courses"] == value]

In [18]:
df[df["Courses"] != 'Spark']

   Courses    Fee Duration  Discount
0     HTML  60000   20days      6000
2  PySpark  25000   50days      2300
3   Hadoop  23000   30days      1000
4   Python  24000     None      1200
5   Pandas  26000      NaN      2500

In [8]:

df2=df.query("Courses == 'Spark'")
print(df2)

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [19]:
# Filter Rows Based on List of Values
values=["Spark","PySpark"]
print(df[df["Courses"].isin(values)] )
# Using df.loc
print(df.loc[df['Courses'].isin(values)])

   Courses    Fee Duration  Discount
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300
   Courses    Fee Duration  Discount
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300

In [20]:

df2=df.loc[~df['Courses'].isin(values)]
print(df2)

  Courses    Fee Duration  Discount
0    HTML  60000   20days      6000
3  Hadoop  23000   30days      1000
4  Python  24000     None      1200
5  Pandas  26000      NaN      2500

In [21]:

# By using lambda function
print(df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])]))

   Courses    Fee Duration  Discount
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300

In [22]:
# Filter rows by ignoreing columns 
# that have None & Nan values
print(df.dropna())

   Courses    Fee Duration  Discount
0     HTML  60000   20days      6000
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300
3   Hadoop  23000   30days      1000

In [23]:

print(df.dropna(axis='columns'))

   Courses    Fee  Discount
0     HTML  60000      6000
1    Spark  22000      1000
2  PySpark  25000      2300
3   Hadoop  23000      1000
4   Python  24000      1200
5   Pandas  26000      2500

In [24]:

# Filter based on value contains
print(df[df['Courses'].str.contains("Spark")])

# Filter after converting values
print(df[df['Courses'].str.lower().str.contains("spark")])

#Filter startswith
print(df[df['Courses'].str.startswith("P")])

   Courses    Fee Duration  Discount
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300
   Courses    Fee Duration  Discount
1    Spark  22000   30days      1000
2  PySpark  25000   50days      2300
   Courses    Fee Duration  Discount
2  PySpark  25000   50days      2300
4   Python  24000     None      1200
5   Pandas  26000      NaN      2500